In [1]:

import pandas as pd
pd.DataFrame({'yes':[50,21],'no':[131,2]})

   yes   no
0   50  131
1   21    2

In [25]:
dataset= pd.read_csv("Data.csv")

In [3]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [4]:
dataset.shape

(10, 4)

In [5]:
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [6]:
dataset['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [7]:
dataset['Country'][0:4]

0     France
1      Spain
2    Germany
3      Spain
Name: Country, dtype: object

In [8]:
dataset['Country'][0]

'France'

In [9]:
dataset.Country =='Germany'

0    False
1    False
2     True
3    False
4     True
5    False
6    False
7    False
8     True
9    False
Name: Country, dtype: bool

In [10]:
Germany_column=dataset.loc[dataset.Country=='Germany']

In [11]:
Germany_column

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
4  Germany  40.0      NaN       Yes
8  Germany  50.0  83000.0        No

In [12]:
Germany_column.to_csv('Germanydata.csv')

In [15]:
dataset.loc[dataset.Salary.isnull()]

   Country   Age  Salary Purchased
4  Germany  40.0     NaN       Yes

In [16]:
dataset.loc[dataset.Salary.notnull()]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [26]:
dataset.loc[2,'Salary']=250000

In [27]:
dataset

   Country   Age    Salary Purchased
0   France  44.0   72000.0        No
1    Spain  27.0   48000.0       Yes
2  Germany  30.0  250000.0        No
3    Spain  38.0   61000.0        No
4  Germany  40.0       NaN       Yes
5   France  35.0   58000.0       Yes
6    Spain   NaN   52000.0        No
7   France  48.0   79000.0       Yes
8  Germany  50.0   83000.0        No
9   France  37.0   67000.0       Yes

In [29]:
dataset.Salary.describe()

count         9.000000
mean      85555.555556
std       62767.649134
min       48000.000000
25%       58000.000000
50%       67000.000000
75%       79000.000000
max      250000.000000
Name: Salary, dtype: float64

In [31]:
dataset.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [33]:
dataset.Salary.dtype

dtype('float64')

In [37]:
dataset.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object